thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_gpt.h
/******************************************************************************
 *  Filename:       hw_gpt_h
 *  Revised:        2017-01-31 09:37:48 +0100 (Tue, 31 Jan 2017)
 *  Revision:       48345
 *
 * Copyright (c) 2015 - 2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1) Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2) Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3) Neither the name of the ORGANIZATION nor the names of its contributors may
 *    be used to endorse or promote products derived from this software without
 *    specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************/

#ifndef __HW_GPT_H__
#define __HW_GPT_H__

//*****************************************************************************
//
// This section defines the register offsets of
// GPT component
//
//*****************************************************************************
// Configuration
#define GPT_O_CFG 0x00000000

// Timer A Mode
#define GPT_O_TAMR 0x00000004

// Timer B Mode
#define GPT_O_TBMR 0x00000008

// Control
#define GPT_O_CTL 0x0000000C

// Synch Register
#define GPT_O_SYNC 0x00000010

// Interrupt Mask
#define GPT_O_IMR 0x00000018

// Raw Interrupt Status
#define GPT_O_RIS 0x0000001C

// Masked Interrupt Status
#define GPT_O_MIS 0x00000020

// Interrupt Clear
#define GPT_O_ICLR 0x00000024

// Timer A Interval Load  Register
#define GPT_O_TAILR 0x00000028

// Timer B Interval Load  Register
#define GPT_O_TBILR 0x0000002C

// Timer A Match Register
#define GPT_O_TAMATCHR 0x00000030

// Timer B Match Register
#define GPT_O_TBMATCHR 0x00000034

// Timer A Pre-scale
#define GPT_O_TAPR 0x00000038

// Timer B Pre-scale
#define GPT_O_TBPR 0x0000003C

// Timer A Pre-scale Match
#define GPT_O_TAPMR 0x00000040

// Timer B Pre-scale Match
#define GPT_O_TBPMR 0x00000044

// Timer A Register
#define GPT_O_TAR 0x00000048

// Timer B Register
#define GPT_O_TBR 0x0000004C

// Timer A Value
#define GPT_O_TAV 0x00000050

// Timer B Value
#define GPT_O_TBV 0x00000054

// Timer A Pre-scale Snap-shot
#define GPT_O_TAPS 0x0000005C

// Timer B Pre-scale Snap-shot
#define GPT_O_TBPS 0x00000060

// Timer A Pre-scale Value
#define GPT_O_TAPV 0x00000064

// Timer B Pre-scale Value
#define GPT_O_TBPV 0x00000068

// DMA Event
#define GPT_O_DMAEV 0x0000006C

// Peripheral Version
#define GPT_O_VERSION 0x00000FB0

// Combined CCP Output
#define GPT_O_ANDCCP 0x00000FB4

//*****************************************************************************
//
// Register: GPT_O_CFG
//
//*****************************************************************************
// Field:   [2:0] CFG
//
// GPT Configuration
// 0x2- 0x3 - Reserved
// 0x5- 0x7 - Reserved
// ENUMs:
// 16BIT_TIMER              16-bit timer configuration.
//                          Configure for two 16-bit
//                          timers.
//                          Also see TAMR.TAMR and
//                          TBMR.TBMR.
// 32BIT_TIMER              32-bit timer configuration
#define GPT_CFG_CFG_W 3
#define GPT_CFG_CFG_M 0x00000007
#define GPT_CFG_CFG_S 0
#define GPT_CFG_CFG_16BIT_TIMER 0x00000004
#define GPT_CFG_CFG_32BIT_TIMER 0x00000000

//*****************************************************************************
//
// Register: GPT_O_TAMR
//
//*****************************************************************************
// Field: [15:13] TCACT
//
// Timer Compare Action Select
// ENUMs:
// CLRSET_ON_TO             Clear CCP output pin immediately and set on
//                          Time-Out
// SETCLR_ON_TO             Set CCP output pin immediately and clear on
//                          Time-Out
// CLRTOG_ON_TO             Clear CCP output pin immediately and toggle on
//                          Time-Out
// SETTOG_ON_TO             Set CCP output pin immediately and toggle on
//                          Time-Out
// SET_ON_TO                Set CCP output pin on Time-Out
// CLR_ON_TO                Clear CCP output pin on Time-Out
// TOG_ON_TO                Toggle State on Time-Out
// DIS_CMP                  Disable compare operations
#define GPT_TAMR_TCACT_W 3
#define GPT_TAMR_TCACT_M 0x0000E000
#define GPT_TAMR_TCACT_S 13
#define GPT_TAMR_TCACT_CLRSET_ON_TO 0x0000E000
#define GPT_TAMR_TCACT_SETCLR_ON_TO 0x0000C000
#define GPT_TAMR_TCACT_CLRTOG_ON_TO 0x0000A000
#define GPT_TAMR_TCACT_SETTOG_ON_TO 0x00008000
#define GPT_TAMR_TCACT_SET_ON_TO 0x00006000
#define GPT_TAMR_TCACT_CLR_ON_TO 0x00004000
#define GPT_TAMR_TCACT_TOG_ON_TO 0x00002000
#define GPT_TAMR_TCACT_DIS_CMP 0x00000000

// Field:    [12] TACINTD
//
// One-Shot/Periodic Interrupt Disable
// ENUMs:
// DIS_TO_INTR              Time-out interrupt are disabled
// EN_TO_INTR               Time-out interrupt function as normal
#define GPT_TAMR_TACINTD 0x00001000
#define GPT_TAMR_TACINTD_BITN 12
#define GPT_TAMR_TACINTD_M 0x00001000
#define GPT_TAMR_TACINTD_S 12
#define GPT_TAMR_TACINTD_DIS_TO_INTR 0x00001000
#define GPT_TAMR_TACINTD_EN_TO_INTR 0x00000000

// Field:    [11] TAPLO
//
// GPTM Timer A PWM Legacy Operation
//
// 0  Legacy operation with CCP pin driven Low when the TAILR
// register is reloaded after the timer reaches 0.
//
// 1 CCP is driven High when the TAILR  register is reloaded after the timer
// reaches 0.
//
// This bit is only valid in PWM mode.
// ENUMs:
// CCP_ON_TO                CCP output pin is set to 1 on time-out
// LEGACY                   Legacy operation
#define GPT_TAMR_TAPLO 0x00000800
#define GPT_TAMR_TAPLO_BITN 11
#define GPT_TAMR_TAPLO_M 0x00000800
#define GPT_TAMR_TAPLO_S 11
#define GPT_TAMR_TAPLO_CCP_ON_TO 0x00000800
#define GPT_TAMR_TAPLO_LEGACY 0x00000000

// Field:    [10] TAMRSU
//
// Timer A Match Register Update mode
//
// This bit defines when the TAMATCHR and TAPR registers are updated.
//
// If the timer is disabled (CTL.TAEN = 0) when this bit is set, TAMATCHR and
// TAPR are updated when the timer is enabled.
// If the timer is stalled (CTL.TASTALL = 1) when this bit is set, TAMATCHR and
// TAPR are updated according to the configuration of this bit.
// ENUMs:
// TOUPDATE                 Update TAMATCHR and TAPR, if used, on the next
//                          time-out.
// CYCLEUPDATE              Update TAMATCHR and TAPR, if used, on the next
//                          cycle.
#define GPT_TAMR_TAMRSU 0x00000400
#define GPT_TAMR_TAMRSU_BITN 10
#define GPT_TAMR_TAMRSU_M 0x00000400
#define GPT_TAMR_TAMRSU_S 10
#define GPT_TAMR_TAMRSU_TOUPDATE 0x00000400
#define GPT_TAMR_TAMRSU_CYCLEUPDATE 0x00000000

// Field:     [9] TAPWMIE
//
// GPTM Timer A PWM Interrupt Enable
// This bit enables interrupts in PWM mode on rising, falling, or both edges of
// the CCP output, as defined by the CTL.TAEVENT
// In addition, when this bit is set and a capture event occurs, Timer A
// automatically generates triggers to the DMA if the trigger capability is
// enabled by setting the CTL.TAOTE bit and the DMAEV.CAEDMAEN bit
// respectively.
//
// 0 Capture event interrupt is disabled.
// 1 Capture event interrupt is enabled.
// This bit is only valid in PWM mode.
// ENUMs:
// EN                       Interrupt is enabled.  This bit is only valid in
//                          PWM mode.
// DIS                      Interrupt is disabled.
#define GPT_TAMR_TAPWMIE 0x00000200
#define GPT_TAMR_TAPWMIE_BITN 9
#define GPT_TAMR_TAPWMIE_M 0x00000200
#define GPT_TAMR_TAPWMIE_S 9
#define GPT_TAMR_TAPWMIE_EN 0x00000200
#define GPT_TAMR_TAPWMIE_DIS 0x00000000

// Field:     [8] TAILD
//
// GPT Timer A PWM Interval Load Write
// ENUMs:
// TOUPDATE                 Update the TAR register with the value in the
//                          TAILR register on the next timeout. If the
//                          prescaler is used, update the TAPS register
//                          with the value in the TAPR register on the next
//                          timeout.
// CYCLEUPDATE              Update the TAR register with the value in the
//                          TAILR register on the next clock cycle. If the
//                          pre-scaler is used, update the TAPS register
//                          with the value in the TAPR register on the next
//                          clock cycle.
#define GPT_TAMR_TAILD 0x00000100
#define GPT_TAMR_TAILD_BITN 8
#define GPT_TAMR_TAILD_M 0x00000100
#define GPT_TAMR_TAILD_S 8
#define GPT_TAMR_TAILD_TOUPDATE 0x00000100
#define GPT_TAMR_TAILD_CYCLEUPDATE 0x00000000

// Field:     [7] TASNAPS
//
// GPT Timer A Snap-Shot Mode
// ENUMs:
// EN                       If Timer A is configured in the periodic mode, the
//                          actual free-running value of Timer A is loaded
//                          at the time-out event into the GPT Timer A
//                          (TAR) register.
// DIS                      Snap-shot mode is disabled.
#define GPT_TAMR_TASNAPS 0x00000080
#define GPT_TAMR_TASNAPS_BITN 7
#define GPT_TAMR_TASNAPS_M 0x00000080
#define GPT_TAMR_TASNAPS_S 7
#define GPT_TAMR_TASNAPS_EN 0x00000080
#define GPT_TAMR_TASNAPS_DIS 0x00000000

// Field:     [6] TAWOT
//
// GPT Timer A Wait-On-Trigger
// ENUMs:
// WAIT                     If Timer A is enabled (CTL.TAEN = 1), Timer A does
//                          not begin counting until it receives a trigger
//                          from the timer in the previous position in the
//                          daisy chain. This bit must be clear for GPT
//                          Module 0, Timer A. This function is valid for
//                          one-shot, periodic, and PWM modes
// NOWAIT                   Timer A begins counting as soon as it is enabled.
#define GPT_TAMR_TAWOT 0x00000040
#define GPT_TAMR_TAWOT_BITN 6
#define GPT_TAMR_TAWOT_M 0x00000040
#define GPT_TAMR_TAWOT_S 6
#define GPT_TAMR_TAWOT_WAIT 0x00000040
#define GPT_TAMR_TAWOT_NOWAIT 0x00000000

