thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_gpt.h
// Field:     [5] TAMIE
//
// GPT Timer A Match Interrupt Enable
// ENUMs:
// EN                       An interrupt is generated when the match value in
//                          TAMATCHR is reached in the one-shot and
//                          periodic modes.
// DIS                      The match interrupt is disabled for match events.
//                          Additionally, output triggers on match events
//                          are prevented.
#define GPT_TAMR_TAMIE 0x00000020
#define GPT_TAMR_TAMIE_BITN 5
#define GPT_TAMR_TAMIE_M 0x00000020
#define GPT_TAMR_TAMIE_S 5
#define GPT_TAMR_TAMIE_EN 0x00000020
#define GPT_TAMR_TAMIE_DIS 0x00000000

// Field:     [4] TACDIR
//
// GPT Timer A Count Direction
// ENUMs:
// UP                       The timer counts up. When counting up, the timer
//                          starts from a value of 0x0.
// DOWN                     The timer counts down.
#define GPT_TAMR_TACDIR 0x00000010
#define GPT_TAMR_TACDIR_BITN 4
#define GPT_TAMR_TACDIR_M 0x00000010
#define GPT_TAMR_TACDIR_S 4
#define GPT_TAMR_TACDIR_UP 0x00000010
#define GPT_TAMR_TACDIR_DOWN 0x00000000

// Field:     [3] TAAMS
//
// GPT Timer A Alternate Mode
//
// Note: To enable PWM mode, you must also clear TACM and then configure TAMR
// field to 0x2.
// ENUMs:
// PWM                      PWM mode is enabled
// CAP_COMP                 Capture/Compare mode is enabled.
#define GPT_TAMR_TAAMS 0x00000008
#define GPT_TAMR_TAAMS_BITN 3
#define GPT_TAMR_TAAMS_M 0x00000008
#define GPT_TAMR_TAAMS_S 3
#define GPT_TAMR_TAAMS_PWM 0x00000008
#define GPT_TAMR_TAAMS_CAP_COMP 0x00000000

// Field:     [2] TACM
//
// GPT Timer A Capture Mode
// ENUMs:
// EDGTIME                  Edge-Time mode
// EDGCNT                   Edge-Count mode
#define GPT_TAMR_TACM 0x00000004
#define GPT_TAMR_TACM_BITN 2
#define GPT_TAMR_TACM_M 0x00000004
#define GPT_TAMR_TACM_S 2
#define GPT_TAMR_TACM_EDGTIME 0x00000004
#define GPT_TAMR_TACM_EDGCNT 0x00000000

// Field:   [1:0] TAMR
//
// GPT Timer A Mode
//
// 0x0 Reserved
// 0x1 One-Shot Timer mode
// 0x2 Periodic Timer mode
// 0x3 Capture mode
// The Timer mode is based on the timer configuration defined by bits 2:0 in
// the CFG register
// ENUMs:
// CAPTURE                  Capture mode
// PERIODIC                 Periodic Timer mode
// ONE_SHOT                 One-Shot Timer mode
#define GPT_TAMR_TAMR_W 2
#define GPT_TAMR_TAMR_M 0x00000003
#define GPT_TAMR_TAMR_S 0
#define GPT_TAMR_TAMR_CAPTURE 0x00000003
#define GPT_TAMR_TAMR_PERIODIC 0x00000002
#define GPT_TAMR_TAMR_ONE_SHOT 0x00000001

//*****************************************************************************
//
// Register: GPT_O_TBMR
//
//*****************************************************************************
// Field: [15:13] TCACT
//
// Timer Compare Action Select
// ENUMs:
// CLRSET_ON_TO             Clear CCP output pin immediately and set on
//                          Time-Out
// SETCLR_ON_TO             Set CCP output pin immediately and clear on
//                          Time-Out
// CLRTOG_ON_TO             Clear CCP output pin immediately and toggle on
//                          Time-Out
// SETTOG_ON_TO             Set CCP output pin immediately and toggle on
//                          Time-Out
// SET_ON_TO                Set CCP output pin on Time-Out
// CLR_ON_TO                Clear CCP output pin on Time-Out
// TOG_ON_TO                Toggle State on Time-Out
// DIS_CMP                  Disable compare operations
#define GPT_TBMR_TCACT_W 3
#define GPT_TBMR_TCACT_M 0x0000E000
#define GPT_TBMR_TCACT_S 13
#define GPT_TBMR_TCACT_CLRSET_ON_TO 0x0000E000
#define GPT_TBMR_TCACT_SETCLR_ON_TO 0x0000C000
#define GPT_TBMR_TCACT_CLRTOG_ON_TO 0x0000A000
#define GPT_TBMR_TCACT_SETTOG_ON_TO 0x00008000
#define GPT_TBMR_TCACT_SET_ON_TO 0x00006000
#define GPT_TBMR_TCACT_CLR_ON_TO 0x00004000
#define GPT_TBMR_TCACT_TOG_ON_TO 0x00002000
#define GPT_TBMR_TCACT_DIS_CMP 0x00000000

// Field:    [12] TBCINTD
//
// One-Shot/Periodic Interrupt Mode
// ENUMs:
// DIS_TO_INTR              Mask Time-Out Interrupt
// EN_TO_INTR               Normal Time-Out Interrupt
#define GPT_TBMR_TBCINTD 0x00001000
#define GPT_TBMR_TBCINTD_BITN 12
#define GPT_TBMR_TBCINTD_M 0x00001000
#define GPT_TBMR_TBCINTD_S 12
#define GPT_TBMR_TBCINTD_DIS_TO_INTR 0x00001000
#define GPT_TBMR_TBCINTD_EN_TO_INTR 0x00000000

// Field:    [11] TBPLO
//
// GPTM Timer B PWM Legacy Operation
//
// 0  Legacy operation with CCP pin driven Low when the TBILR
// register is reloaded after the timer reaches 0.
//
// 1 CCP is driven High when the TBILR  register is reloaded after the timer
// reaches 0.
//
// This bit is only valid in PWM mode.
// ENUMs:
// CCP_ON_TO                CCP output pin is set to 1 on time-out
// LEGACY                   Legacy operation
#define GPT_TBMR_TBPLO 0x00000800
#define GPT_TBMR_TBPLO_BITN 11
#define GPT_TBMR_TBPLO_M 0x00000800
#define GPT_TBMR_TBPLO_S 11
#define GPT_TBMR_TBPLO_CCP_ON_TO 0x00000800
#define GPT_TBMR_TBPLO_LEGACY 0x00000000

// Field:    [10] TBMRSU
//
// Timer B Match Register Update mode
//
// This bit defines when the TBMATCHR and TBPR registers are updated
//
// If the timer is disabled (CTL.TBEN is clear) when this bit is set, TBMATCHR
// and TBPR are updated when the timer is enabled.
// If the timer is stalled (CTL.TBSTALL is set) when this bit is set, TBMATCHR
// and TBPR are updated according to the configuration of this bit.
// ENUMs:
// TOUPDATE                 Update TBMATCHR and TBPR, if used, on the next
//                          time-out.
// CYCLEUPDATE              Update TBMATCHR and TBPR, if used, on the next
//                          cycle.
#define GPT_TBMR_TBMRSU 0x00000400
#define GPT_TBMR_TBMRSU_BITN 10
#define GPT_TBMR_TBMRSU_M 0x00000400
#define GPT_TBMR_TBMRSU_S 10
#define GPT_TBMR_TBMRSU_TOUPDATE 0x00000400
#define GPT_TBMR_TBMRSU_CYCLEUPDATE 0x00000000

