thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_gpt.h
// Field:     [9] TBPWMIE
//
// GPTM Timer B PWM Interrupt Enable
// This bit enables interrupts in PWM mode on rising, falling, or both edges of
// the CCP output, as defined by the CTL.TBEVENT
// In addition, when this bit is set and a capture event occurs, Timer A
// automatically generates triggers to the DMA if the trigger capability is
// enabled by setting the CTL.TBOTE bit and the DMAEV.CBEDMAEN bit
// respectively.
//
// 0 Capture event interrupt is disabled.
// 1 Capture event interrupt is enabled.
// This bit is only valid in PWM mode.
// ENUMs:
// EN                       Interrupt is enabled.  This bit is only valid in
//                          PWM mode.
// DIS                      Interrupt is disabled.
#define GPT_TBMR_TBPWMIE 0x00000200
#define GPT_TBMR_TBPWMIE_BITN 9
#define GPT_TBMR_TBPWMIE_M 0x00000200
#define GPT_TBMR_TBPWMIE_S 9
#define GPT_TBMR_TBPWMIE_EN 0x00000200
#define GPT_TBMR_TBPWMIE_DIS 0x00000000

// Field:     [8] TBILD
//
// GPT Timer B PWM Interval Load Write
// ENUMs:
// TOUPDATE                 Update the TBR register with the value in the
//                          TBILR register on the next timeout. If the
//                          prescaler is used, update the TBPS register
//                          with the value in the TBPR register on the next
//                          timeout.
// CYCLEUPDATE              Update the TBR register with the value in the
//                          TBILR register on the next clock cycle. If the
//                          pre-scaler is used, update the TBPS register
//                          with the value in the TBPR register on the next
//                          clock cycle.
#define GPT_TBMR_TBILD 0x00000100
#define GPT_TBMR_TBILD_BITN 8
#define GPT_TBMR_TBILD_M 0x00000100
#define GPT_TBMR_TBILD_S 8
#define GPT_TBMR_TBILD_TOUPDATE 0x00000100
#define GPT_TBMR_TBILD_CYCLEUPDATE 0x00000000

// Field:     [7] TBSNAPS
//
// GPT Timer B Snap-Shot Mode
// ENUMs:
// EN                       If Timer B is configured in the periodic mode
// DIS                      Snap-shot mode is disabled.
#define GPT_TBMR_TBSNAPS 0x00000080
#define GPT_TBMR_TBSNAPS_BITN 7
#define GPT_TBMR_TBSNAPS_M 0x00000080
#define GPT_TBMR_TBSNAPS_S 7
#define GPT_TBMR_TBSNAPS_EN 0x00000080
#define GPT_TBMR_TBSNAPS_DIS 0x00000000

// Field:     [6] TBWOT
//
// GPT Timer B Wait-On-Trigger
// ENUMs:
// WAIT                     If Timer B is enabled (CTL.TBEN is set), Timer B
//                          does not begin counting until it receives a
//                          trigger from the timer in the previous position
//                          in the daisy chain. This function is valid for
//                          one-shot, periodic, and PWM modes
// NOWAIT                   Timer B begins counting as soon as it is enabled.
#define GPT_TBMR_TBWOT 0x00000040
#define GPT_TBMR_TBWOT_BITN 6
#define GPT_TBMR_TBWOT_M 0x00000040
#define GPT_TBMR_TBWOT_S 6
#define GPT_TBMR_TBWOT_WAIT 0x00000040
#define GPT_TBMR_TBWOT_NOWAIT 0x00000000

// Field:     [5] TBMIE
//
// GPT Timer B Match Interrupt Enable.
// ENUMs:
// EN                       An interrupt is generated when the match value in
//                          the TBMATCHR register is reached in the
//                          one-shot and periodic modes.
// DIS                      The match interrupt is disabled for match events.
//                          Additionally, output triggers on match events
//                          are prevented.
#define GPT_TBMR_TBMIE 0x00000020
#define GPT_TBMR_TBMIE_BITN 5
#define GPT_TBMR_TBMIE_M 0x00000020
#define GPT_TBMR_TBMIE_S 5
#define GPT_TBMR_TBMIE_EN 0x00000020
#define GPT_TBMR_TBMIE_DIS 0x00000000

// Field:     [4] TBCDIR
//
// GPT Timer B Count Direction
// ENUMs:
// UP                       The timer counts up. When counting up, the timer
//                          starts from a value of 0x0.
// DOWN                     The timer counts down.
#define GPT_TBMR_TBCDIR 0x00000010
#define GPT_TBMR_TBCDIR_BITN 4
#define GPT_TBMR_TBCDIR_M 0x00000010
#define GPT_TBMR_TBCDIR_S 4
#define GPT_TBMR_TBCDIR_UP 0x00000010
#define GPT_TBMR_TBCDIR_DOWN 0x00000000

// Field:     [3] TBAMS
//
// GPT Timer B Alternate Mode
//
// Note: To enable PWM mode, you must also clear TBCM bit and configure TBMR
// field to 0x2.
// ENUMs:
// PWM                      PWM mode is enabled
// CAP_COMP                 Capture/Compare mode is enabled.
#define GPT_TBMR_TBAMS 0x00000008
#define GPT_TBMR_TBAMS_BITN 3
#define GPT_TBMR_TBAMS_M 0x00000008
#define GPT_TBMR_TBAMS_S 3
#define GPT_TBMR_TBAMS_PWM 0x00000008
#define GPT_TBMR_TBAMS_CAP_COMP 0x00000000

// Field:     [2] TBCM
//
// GPT Timer B Capture Mode
// ENUMs:
// EDGTIME                  Edge-Time mode
// EDGCNT                   Edge-Count mode
#define GPT_TBMR_TBCM 0x00000004
#define GPT_TBMR_TBCM_BITN 2
#define GPT_TBMR_TBCM_M 0x00000004
#define GPT_TBMR_TBCM_S 2
#define GPT_TBMR_TBCM_EDGTIME 0x00000004
#define GPT_TBMR_TBCM_EDGCNT 0x00000000

// Field:   [1:0] TBMR
//
// GPT Timer B Mode
//
// 0x0 Reserved
// 0x1 One-Shot Timer mode
// 0x2 Periodic Timer mode
// 0x3 Capture mode
// The Timer mode is based on the timer configuration defined by bits 2:0 in
// the CFG register
// ENUMs:
// CAPTURE                  Capture mode
// PERIODIC                 Periodic Timer mode
// ONE_SHOT                 One-Shot Timer mode
#define GPT_TBMR_TBMR_W 2
#define GPT_TBMR_TBMR_M 0x00000003
#define GPT_TBMR_TBMR_S 0
#define GPT_TBMR_TBMR_CAPTURE 0x00000003
#define GPT_TBMR_TBMR_PERIODIC 0x00000002
#define GPT_TBMR_TBMR_ONE_SHOT 0x00000001

//*****************************************************************************
//
// Register: GPT_O_CTL
//
//*****************************************************************************
// Field:    [14] TBPWML
//
// GPT Timer B PWM Output Level
//
// 0: Output is unaffected.
// 1: Output is inverted.
// ENUMs:
// INVERTED                 Inverted
// NORMAL                   Not inverted
#define GPT_CTL_TBPWML 0x00004000
#define GPT_CTL_TBPWML_BITN 14
#define GPT_CTL_TBPWML_M 0x00004000
#define GPT_CTL_TBPWML_S 14
#define GPT_CTL_TBPWML_INVERTED 0x00004000
#define GPT_CTL_TBPWML_NORMAL 0x00000000

// Field: [11:10] TBEVENT
//
// GPT Timer B Event Mode
//
// The values in this register are defined as follows:
// Value Description
// 0x0 Positive edge
// 0x1 Negative edge
// 0x2 Reserved
// 0x3 Both edges
// Note: If PWM output inversion is enabled, edge detection interrupt
// behavior is reversed. Thus, if a positive-edge interrupt trigger
// has been set and the PWM inversion generates a postive
// edge, no event-trigger interrupt asserts. Instead, the interrupt
// is generated on the negative edge of the PWM signal.
// ENUMs:
// BOTH                     Both edges
// NEG                      Negative edge
// POS                      Positive edge
#define GPT_CTL_TBEVENT_W 2
#define GPT_CTL_TBEVENT_M 0x00000C00
#define GPT_CTL_TBEVENT_S 10
#define GPT_CTL_TBEVENT_BOTH 0x00000C00
#define GPT_CTL_TBEVENT_NEG 0x00000400
#define GPT_CTL_TBEVENT_POS 0x00000000

// Field:     [9] TBSTALL
//
// GPT Timer B Stall Enable
// ENUMs:
// EN                       Timer B freezes counting while the processor is
//                          halted by the debugger.
// DIS                      Timer B continues counting while the processor is
//                          halted by the debugger.
#define GPT_CTL_TBSTALL 0x00000200
#define GPT_CTL_TBSTALL_BITN 9
#define GPT_CTL_TBSTALL_M 0x00000200
#define GPT_CTL_TBSTALL_S 9
#define GPT_CTL_TBSTALL_EN 0x00000200
#define GPT_CTL_TBSTALL_DIS 0x00000000

// Field:     [8] TBEN
//
// GPT Timer B Enable
// ENUMs:
// EN                       Timer B is enabled and begins counting or the
//                          capture logic is enabled based on CFG register.
// DIS                      Timer B is disabled.
#define GPT_CTL_TBEN 0x00000100
#define GPT_CTL_TBEN_BITN 8
#define GPT_CTL_TBEN_M 0x00000100
#define GPT_CTL_TBEN_S 8
#define GPT_CTL_TBEN_EN 0x00000100
#define GPT_CTL_TBEN_DIS 0x00000000

