thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_gpt.h
// Field:     [6] TAPWML
//
// GPT Timer A PWM Output Level
// ENUMs:
// INVERTED                 Inverted
// NORMAL                   Not inverted
#define GPT_CTL_TAPWML 0x00000040
#define GPT_CTL_TAPWML_BITN 6
#define GPT_CTL_TAPWML_M 0x00000040
#define GPT_CTL_TAPWML_S 6
#define GPT_CTL_TAPWML_INVERTED 0x00000040
#define GPT_CTL_TAPWML_NORMAL 0x00000000

// Field:   [3:2] TAEVENT
//
// GPT Timer A Event Mode
//
// The values in this register are defined as follows:
// Value Description
// 0x0 Positive edge
// 0x1 Negative edge
// 0x2 Reserved
// 0x3 Both edges
// Note: If PWM output inversion is enabled, edge detection interrupt
// behavior is reversed. Thus, if a positive-edge interrupt trigger
// has been set and the PWM inversion generates a postive
// edge, no event-trigger interrupt asserts. Instead, the interrupt
// is generated on the negative edge of the PWM signal.
// ENUMs:
// BOTH                     Both edges
// NEG                      Negative edge
// POS                      Positive edge
#define GPT_CTL_TAEVENT_W 2
#define GPT_CTL_TAEVENT_M 0x0000000C
#define GPT_CTL_TAEVENT_S 2
#define GPT_CTL_TAEVENT_BOTH 0x0000000C
#define GPT_CTL_TAEVENT_NEG 0x00000004
#define GPT_CTL_TAEVENT_POS 0x00000000

// Field:     [1] TASTALL
//
// GPT Timer A Stall Enable
// ENUMs:
// EN                       Timer A freezes counting while the processor is
//                          halted by the debugger.
// DIS                      Timer A continues counting while the processor is
//                          halted by the debugger.
#define GPT_CTL_TASTALL 0x00000002
#define GPT_CTL_TASTALL_BITN 1
#define GPT_CTL_TASTALL_M 0x00000002
#define GPT_CTL_TASTALL_S 1
#define GPT_CTL_TASTALL_EN 0x00000002
#define GPT_CTL_TASTALL_DIS 0x00000000

// Field:     [0] TAEN
//
// GPT Timer A Enable
// ENUMs:
// EN                       Timer A is enabled and begins counting or the
//                          capture logic is enabled based on the CFG
//                          register.
// DIS                      Timer A is disabled.
#define GPT_CTL_TAEN 0x00000001
#define GPT_CTL_TAEN_BITN 0
#define GPT_CTL_TAEN_M 0x00000001
#define GPT_CTL_TAEN_S 0
#define GPT_CTL_TAEN_EN 0x00000001
#define GPT_CTL_TAEN_DIS 0x00000000

//*****************************************************************************
//
// Register: GPT_O_SYNC
//
//*****************************************************************************
// Field:   [7:6] SYNC3
//
// Synchronize GPT Timer 3.
// ENUMs:
// BOTH                     A timeout event for both Timer A and Timer B of
//                          GPT3 is triggered
// TIMERB                   A timeout event for Timer B of GPT3 is triggered
// TIMERA                   A timeout event for Timer A of GPT3 is triggered
// NOSYNC                   No Sync. GPT3 is not affected.
#define GPT_SYNC_SYNC3_W 2
#define GPT_SYNC_SYNC3_M 0x000000C0
#define GPT_SYNC_SYNC3_S 6
#define GPT_SYNC_SYNC3_BOTH 0x000000C0
#define GPT_SYNC_SYNC3_TIMERB 0x00000080
#define GPT_SYNC_SYNC3_TIMERA 0x00000040
#define GPT_SYNC_SYNC3_NOSYNC 0x00000000

// Field:   [5:4] SYNC2
//
// Synchronize GPT Timer 2.
// ENUMs:
// BOTH                     A timeout event for both Timer A and Timer B of
//                          GPT2 is triggered
// TIMERB                   A timeout event for Timer B of GPT2 is triggered
// TIMERA                   A timeout event for Timer A of GPT2 is triggered
// NOSYNC                   No Sync. GPT2 is not affected.
#define GPT_SYNC_SYNC2_W 2
#define GPT_SYNC_SYNC2_M 0x00000030
#define GPT_SYNC_SYNC2_S 4
#define GPT_SYNC_SYNC2_BOTH 0x00000030
#define GPT_SYNC_SYNC2_TIMERB 0x00000020
#define GPT_SYNC_SYNC2_TIMERA 0x00000010
#define GPT_SYNC_SYNC2_NOSYNC 0x00000000

// Field:   [3:2] SYNC1
//
// Synchronize GPT Timer 1
// ENUMs:
// BOTH                     A timeout event for both Timer A and Timer B of
//                          GPT1 is triggered
// TIMERB                   A timeout event for Timer B of GPT1 is triggered
// TIMERA                   A timeout event for Timer A of GPT1 is triggered
// NOSYNC                   No Sync. GPT1 is not affected.
#define GPT_SYNC_SYNC1_W 2
#define GPT_SYNC_SYNC1_M 0x0000000C
#define GPT_SYNC_SYNC1_S 2
#define GPT_SYNC_SYNC1_BOTH 0x0000000C
#define GPT_SYNC_SYNC1_TIMERB 0x00000008
#define GPT_SYNC_SYNC1_TIMERA 0x00000004
#define GPT_SYNC_SYNC1_NOSYNC 0x00000000

// Field:   [1:0] SYNC0
//
// Synchronize GPT Timer 0
// ENUMs:
// BOTH                     A timeout event for both Timer A and Timer B of
//                          GPT0 is triggered
// TIMERB                   A timeout event for Timer B of GPT0 is triggered
// TIMERA                   A timeout event for Timer A of GPT0 is triggered
// NOSYNC                   No Sync. GPT0 is not affected.
#define GPT_SYNC_SYNC0_W 2
#define GPT_SYNC_SYNC0_M 0x00000003
#define GPT_SYNC_SYNC0_S 0
#define GPT_SYNC_SYNC0_BOTH 0x00000003
#define GPT_SYNC_SYNC0_TIMERB 0x00000002
#define GPT_SYNC_SYNC0_TIMERA 0x00000001
#define GPT_SYNC_SYNC0_NOSYNC 0x00000000

//*****************************************************************************
//
// Register: GPT_O_IMR
//
//*****************************************************************************
// Field:    [13] DMABIM
//
// Enabling this bit will make the RIS.DMABRIS interrupt propagate to
// MIS.DMABMIS
// ENUMs:
// EN                       Enable Interrupt
// DIS                      Disable Interrupt
#define GPT_IMR_DMABIM 0x00002000
#define GPT_IMR_DMABIM_BITN 13
#define GPT_IMR_DMABIM_M 0x00002000
#define GPT_IMR_DMABIM_S 13
#define GPT_IMR_DMABIM_EN 0x00002000
#define GPT_IMR_DMABIM_DIS 0x00000000

// Field:    [11] TBMIM
//
// Enabling this bit will make the RIS.TBMRIS interrupt propagate to MIS.TBMMIS
// ENUMs:
// EN                       Enable Interrupt
// DIS                      Disable Interrupt
#define GPT_IMR_TBMIM 0x00000800
#define GPT_IMR_TBMIM_BITN 11
#define GPT_IMR_TBMIM_M 0x00000800
#define GPT_IMR_TBMIM_S 11
#define GPT_IMR_TBMIM_EN 0x00000800
#define GPT_IMR_TBMIM_DIS 0x00000000

// Field:    [10] CBEIM
//
// Enabling this bit will make the RIS.CBERIS interrupt propagate to MIS.CBEMIS
// ENUMs:
// EN                       Enable Interrupt
// DIS                      Disable Interrupt
#define GPT_IMR_CBEIM 0x00000400
#define GPT_IMR_CBEIM_BITN 10
#define GPT_IMR_CBEIM_M 0x00000400
#define GPT_IMR_CBEIM_S 10
#define GPT_IMR_CBEIM_EN 0x00000400
#define GPT_IMR_CBEIM_DIS 0x00000000

// Field:     [9] CBMIM
//
// Enabling this bit will make the RIS.CBMRIS interrupt propagate to MIS.CBMMIS
// ENUMs:
// EN                       Enable Interrupt
// DIS                      Disable Interrupt
#define GPT_IMR_CBMIM 0x00000200
#define GPT_IMR_CBMIM_BITN 9
#define GPT_IMR_CBMIM_M 0x00000200
#define GPT_IMR_CBMIM_S 9
#define GPT_IMR_CBMIM_EN 0x00000200
#define GPT_IMR_CBMIM_DIS 0x00000000

// Field:     [8] TBTOIM
//
// Enabling this bit will make the RIS.TBTORIS interrupt propagate to
// MIS.TBTOMIS
// ENUMs:
// EN                       Enable Interrupt
// DIS                      Disable Interrupt
#define GPT_IMR_TBTOIM 0x00000100
#define GPT_IMR_TBTOIM_BITN 8
#define GPT_IMR_TBTOIM_M 0x00000100
#define GPT_IMR_TBTOIM_S 8
#define GPT_IMR_TBTOIM_EN 0x00000100
#define GPT_IMR_TBTOIM_DIS 0x00000000

// Field:     [5] DMAAIM
//
// Enabling this bit will make the RIS.DMAARIS interrupt propagate to
// MIS.DMAAMIS
// ENUMs:
// EN                       Enable Interrupt
// DIS                      Disable Interrupt
#define GPT_IMR_DMAAIM 0x00000020
#define GPT_IMR_DMAAIM_BITN 5
#define GPT_IMR_DMAAIM_M 0x00000020
#define GPT_IMR_DMAAIM_S 5
#define GPT_IMR_DMAAIM_EN 0x00000020
#define GPT_IMR_DMAAIM_DIS 0x00000000

