thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_gpt.h
// Field:     [4] TAMIM
//
// Enabling this bit will make the RIS.TAMRIS interrupt propagate to MIS.TAMMIS
// ENUMs:
// EN                       Enable Interrupt
// DIS                      Disable Interrupt
#define GPT_IMR_TAMIM 0x00000010
#define GPT_IMR_TAMIM_BITN 4
#define GPT_IMR_TAMIM_M 0x00000010
#define GPT_IMR_TAMIM_S 4
#define GPT_IMR_TAMIM_EN 0x00000010
#define GPT_IMR_TAMIM_DIS 0x00000000

// Field:     [2] CAEIM
//
// Enabling this bit will make the RIS.CAERIS interrupt propagate to MIS.CAEMIS
// ENUMs:
// EN                       Enable Interrupt
// DIS                      Disable Interrupt
#define GPT_IMR_CAEIM 0x00000004
#define GPT_IMR_CAEIM_BITN 2
#define GPT_IMR_CAEIM_M 0x00000004
#define GPT_IMR_CAEIM_S 2
#define GPT_IMR_CAEIM_EN 0x00000004
#define GPT_IMR_CAEIM_DIS 0x00000000

// Field:     [1] CAMIM
//
// Enabling this bit will make the RIS.CAMRIS interrupt propagate to MIS.CAMMIS
// ENUMs:
// EN                       Enable Interrupt
// DIS                      Disable Interrupt
#define GPT_IMR_CAMIM 0x00000002
#define GPT_IMR_CAMIM_BITN 1
#define GPT_IMR_CAMIM_M 0x00000002
#define GPT_IMR_CAMIM_S 1
#define GPT_IMR_CAMIM_EN 0x00000002
#define GPT_IMR_CAMIM_DIS 0x00000000

// Field:     [0] TATOIM
//
// Enabling this bit will make the RIS.TATORIS interrupt propagate to
// MIS.TATOMIS
// ENUMs:
// EN                       Enable Interrupt
// DIS                      Disable Interrupt
#define GPT_IMR_TATOIM 0x00000001
#define GPT_IMR_TATOIM_BITN 0
#define GPT_IMR_TATOIM_M 0x00000001
#define GPT_IMR_TATOIM_S 0
#define GPT_IMR_TATOIM_EN 0x00000001
#define GPT_IMR_TATOIM_DIS 0x00000000

//*****************************************************************************
//
// Register: GPT_O_RIS
//
//*****************************************************************************
// Field:    [13] DMABRIS
//
// GPT Timer B DMA Done Raw Interrupt Status
//
// 0: Transfer has not completed
// 1: Transfer has completed
#define GPT_RIS_DMABRIS 0x00002000
#define GPT_RIS_DMABRIS_BITN 13
#define GPT_RIS_DMABRIS_M 0x00002000
#define GPT_RIS_DMABRIS_S 13

// Field:    [11] TBMRIS
//
// GPT Timer B Match Raw  Interrupt
//
// 0:  The match value has not been reached
// 1:  The match value is reached.
//
// TBMR.TBMIE is set, and the match values in TBMATCHR and optionally TBPMR
// have been reached when configured in one-shot or periodic mode.
#define GPT_RIS_TBMRIS 0x00000800
#define GPT_RIS_TBMRIS_BITN 11
#define GPT_RIS_TBMRIS_M 0x00000800
#define GPT_RIS_TBMRIS_S 11

// Field:    [10] CBERIS
//
// GPT Timer B Capture Mode Event Raw Interrupt
//
// 0:  The event has not occured.
// 1:  The event has occured.
//
// This interrupt asserts when the subtimer is configured in Input Edge-Time
// mode
#define GPT_RIS_CBERIS 0x00000400
#define GPT_RIS_CBERIS_BITN 10
#define GPT_RIS_CBERIS_M 0x00000400
#define GPT_RIS_CBERIS_S 10

// Field:     [9] CBMRIS
//
// GPT Timer B Capture Mode Match Raw Interrupt
//
// 0:  The capture mode match for Timer B has not occurred.
// 1:  A capture mode match has occurred for Timer B. This interrupt
// asserts when the values in the TBR and TBPR
// match the values in the TBMATCHR and TBPMR
// when configured in Input Edge-Time mode.
//
// This bit is cleared by writing a 1 to the ICLR.CBMCINT bit.
#define GPT_RIS_CBMRIS 0x00000200
#define GPT_RIS_CBMRIS_BITN 9
#define GPT_RIS_CBMRIS_M 0x00000200
#define GPT_RIS_CBMRIS_S 9

// Field:     [8] TBTORIS
//
// GPT Timer B Time-out Raw Interrupt
//
// 0:  Timer B has not timed out
// 1:  Timer B has timed out.
//
// This interrupt is asserted when a one-shot or periodic mode timer reaches
// its count limit. The count limit is 0 or the value loaded into TBILR,
// depending on the count direction.
#define GPT_RIS_TBTORIS 0x00000100
#define GPT_RIS_TBTORIS_BITN 8
#define GPT_RIS_TBTORIS_M 0x00000100
#define GPT_RIS_TBTORIS_S 8

// Field:     [5] DMAARIS
//
// GPT Timer A DMA Done Raw Interrupt Status
//
// 0: Transfer has not completed
// 1: Transfer has completed
#define GPT_RIS_DMAARIS 0x00000020
#define GPT_RIS_DMAARIS_BITN 5
#define GPT_RIS_DMAARIS_M 0x00000020
#define GPT_RIS_DMAARIS_S 5

// Field:     [4] TAMRIS
//
// GPT Timer A Match Raw  Interrupt
//
// 0:  The match value has not been reached
// 1:  The match value is reached.
//
// TAMR.TAMIE is set, and the match values in TAMATCHR and optionally TAPMR
// have been reached when configured in one-shot or periodic mode.
#define GPT_RIS_TAMRIS 0x00000010
#define GPT_RIS_TAMRIS_BITN 4
#define GPT_RIS_TAMRIS_M 0x00000010
#define GPT_RIS_TAMRIS_S 4

// Field:     [2] CAERIS
//
// GPT Timer A Capture Mode Event Raw Interrupt
//
// 0:  The event has not occured.
// 1:  The event has occured.
//
// This interrupt asserts when the subtimer is configured in Input Edge-Time
// mode
#define GPT_RIS_CAERIS 0x00000004
#define GPT_RIS_CAERIS_BITN 2
#define GPT_RIS_CAERIS_M 0x00000004
#define GPT_RIS_CAERIS_S 2

// Field:     [1] CAMRIS
//
// GPT Timer A Capture Mode Match Raw Interrupt
//
// 0:  The capture mode match for Timer A has not occurred.
// 1:  A capture mode match has occurred for Timer A. This interrupt
// asserts when the values in the TAR and TAPR
// match the values in the TAMATCHR and TAPMR
// when configured in Input Edge-Time mode.
//
// This bit is cleared by writing a 1 to the ICLR.CAMCINT bit.
#define GPT_RIS_CAMRIS 0x00000002
#define GPT_RIS_CAMRIS_BITN 1
#define GPT_RIS_CAMRIS_M 0x00000002
#define GPT_RIS_CAMRIS_S 1

// Field:     [0] TATORIS
//
// GPT Timer A Time-out Raw Interrupt
//
// 0:  Timer A has not timed out
// 1:  Timer A has timed out.
//
// This interrupt is asserted when a one-shot or periodic mode timer reaches
// its count limit. The count limit is 0 or the value loaded into TAILR,
// depending on the count direction.
#define GPT_RIS_TATORIS 0x00000001
#define GPT_RIS_TATORIS_BITN 0
#define GPT_RIS_TATORIS_M 0x00000001
#define GPT_RIS_TATORIS_S 0

//*****************************************************************************
//
// Register: GPT_O_MIS
//
//*****************************************************************************
// Field:    [13] DMABMIS
//
// 0: No interrupt or interrupt not enabled
// 1: RIS.DMABRIS = 1 && IMR.DMABIM = 1
#define GPT_MIS_DMABMIS 0x00002000
#define GPT_MIS_DMABMIS_BITN 13
#define GPT_MIS_DMABMIS_M 0x00002000
#define GPT_MIS_DMABMIS_S 13

// Field:    [11] TBMMIS
//
// 0: No interrupt or interrupt not enabled
// 1: RIS.TBMRIS = 1 && IMR.TBMIM = 1
#define GPT_MIS_TBMMIS 0x00000800
#define GPT_MIS_TBMMIS_BITN 11
#define GPT_MIS_TBMMIS_M 0x00000800
#define GPT_MIS_TBMMIS_S 11

// Field:    [10] CBEMIS
//
// 0: No interrupt or interrupt not enabled
// 1: RIS.CBERIS = 1 && IMR.CBEIM = 1
#define GPT_MIS_CBEMIS 0x00000400
#define GPT_MIS_CBEMIS_BITN 10
#define GPT_MIS_CBEMIS_M 0x00000400
#define GPT_MIS_CBEMIS_S 10

// Field:     [9] CBMMIS
//
// 0: No interrupt or interrupt not enabled
// 1: RIS.CBMRIS = 1 && IMR.CBMIM = 1
#define GPT_MIS_CBMMIS 0x00000200
#define GPT_MIS_CBMMIS_BITN 9
#define GPT_MIS_CBMMIS_M 0x00000200
#define GPT_MIS_CBMMIS_S 9

// Field:     [8] TBTOMIS
//
// 0: No interrupt or interrupt not enabled
// 1: RIS.TBTORIS = 1 && IMR.TBTOIM = 1
#define GPT_MIS_TBTOMIS 0x00000100
#define GPT_MIS_TBTOMIS_BITN 8
#define GPT_MIS_TBTOMIS_M 0x00000100
#define GPT_MIS_TBTOMIS_S 8

// Field:     [5] DMAAMIS
//
// 0: No interrupt or interrupt not enabled
// 1: RIS.DMAARIS = 1 && IMR.DMAAIM = 1
#define GPT_MIS_DMAAMIS 0x00000020
#define GPT_MIS_DMAAMIS_BITN 5
#define GPT_MIS_DMAAMIS_M 0x00000020
#define GPT_MIS_DMAAMIS_S 5

// Field:     [4] TAMMIS
//
// 0: No interrupt or interrupt not enabled
// 1: RIS.TAMRIS = 1 && IMR.TAMIM = 1
#define GPT_MIS_TAMMIS 0x00000010
#define GPT_MIS_TAMMIS_BITN 4
#define GPT_MIS_TAMMIS_M 0x00000010
#define GPT_MIS_TAMMIS_S 4

// Field:     [2] CAEMIS
//
// 0: No interrupt or interrupt not enabled
// 1: RIS.CAERIS = 1 && IMR.CAEIM = 1
#define GPT_MIS_CAEMIS 0x00000004
#define GPT_MIS_CAEMIS_BITN 2
#define GPT_MIS_CAEMIS_M 0x00000004
#define GPT_MIS_CAEMIS_S 2

// Field:     [1] CAMMIS
//
// 0: No interrupt or interrupt not enabled
// 1: RIS.CAMRIS = 1 && IMR.CAMIM = 1
#define GPT_MIS_CAMMIS 0x00000002
#define GPT_MIS_CAMMIS_BITN 1
#define GPT_MIS_CAMMIS_M 0x00000002
#define GPT_MIS_CAMMIS_S 1

// Field:     [0] TATOMIS
//
// 0: No interrupt or interrupt not enabled
// 1: RIS.TATORIS = 1 && IMR.TATOIM = 1
#define GPT_MIS_TATOMIS 0x00000001
#define GPT_MIS_TATOMIS_BITN 0
#define GPT_MIS_TATOMIS_M 0x00000001
#define GPT_MIS_TATOMIS_S 0

//*****************************************************************************
//
// Register: GPT_O_ICLR
//
//*****************************************************************************
// Field:    [13] DMABINT
//
// 0: Do nothing.
// 1: Clear RIS.DMABRIS and MIS.DMABMIS
#define GPT_ICLR_DMABINT 0x00002000
#define GPT_ICLR_DMABINT_BITN 13
#define GPT_ICLR_DMABINT_M 0x00002000
#define GPT_ICLR_DMABINT_S 13

