thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_gpt.h
// Field:     [9] CBMDMAEN
//
// GPT Timer B Capture Match DMA Trigger Enable
#define GPT_DMAEV_CBMDMAEN 0x00000200
#define GPT_DMAEV_CBMDMAEN_BITN 9
#define GPT_DMAEV_CBMDMAEN_M 0x00000200
#define GPT_DMAEV_CBMDMAEN_S 9

// Field:     [8] TBTODMAEN
//
// GPT Timer B Time-Out DMA Trigger Enable
#define GPT_DMAEV_TBTODMAEN 0x00000100
#define GPT_DMAEV_TBTODMAEN_BITN 8
#define GPT_DMAEV_TBTODMAEN_M 0x00000100
#define GPT_DMAEV_TBTODMAEN_S 8

// Field:     [4] TAMDMAEN
//
// GPT Timer A Match DMA Trigger Enable
#define GPT_DMAEV_TAMDMAEN 0x00000010
#define GPT_DMAEV_TAMDMAEN_BITN 4
#define GPT_DMAEV_TAMDMAEN_M 0x00000010
#define GPT_DMAEV_TAMDMAEN_S 4

// Field:     [2] CAEDMAEN
//
// GPT Timer A Capture Event DMA Trigger Enable
#define GPT_DMAEV_CAEDMAEN 0x00000004
#define GPT_DMAEV_CAEDMAEN_BITN 2
#define GPT_DMAEV_CAEDMAEN_M 0x00000004
#define GPT_DMAEV_CAEDMAEN_S 2

// Field:     [1] CAMDMAEN
//
// GPT Timer A Capture Match DMA Trigger Enable
#define GPT_DMAEV_CAMDMAEN 0x00000002
#define GPT_DMAEV_CAMDMAEN_BITN 1
#define GPT_DMAEV_CAMDMAEN_M 0x00000002
#define GPT_DMAEV_CAMDMAEN_S 1

// Field:     [0] TATODMAEN
//
// GPT Timer A Time-Out DMA Trigger Enable
#define GPT_DMAEV_TATODMAEN 0x00000001
#define GPT_DMAEV_TATODMAEN_BITN 0
#define GPT_DMAEV_TATODMAEN_M 0x00000001
#define GPT_DMAEV_TATODMAEN_S 0

//*****************************************************************************
//
// Register: GPT_O_VERSION
//
//*****************************************************************************
// Field:  [31:0] VERSION
//
// Timer Revision.
#define GPT_VERSION_VERSION_W 32
#define GPT_VERSION_VERSION_M 0xFFFFFFFF
#define GPT_VERSION_VERSION_S 0

//*****************************************************************************
//
// Register: GPT_O_ANDCCP
//
//*****************************************************************************
// Field:     [0] CCP_AND_EN
//
// Enables AND operation of the CCP outputs for timers A and B.
//
// 0 : PWM outputs of Timer A and Timer B are the internal generated PWM
// signals of the respective timers.
// 1 : PWM output of Timer A is ANDed version of Timer A and Timer B PWM
// signals and Timer B PWM ouput is Timer B PWM signal only.
#define GPT_ANDCCP_CCP_AND_EN 0x00000001
#define GPT_ANDCCP_CCP_AND_EN_BITN 0
#define GPT_ANDCCP_CCP_AND_EN_M 0x00000001
#define GPT_ANDCCP_CCP_AND_EN_S 0

#endif // __GPT__
